#include "intro.h"
#include <iostream>
#include "fraction.h"
void intro() {
	std::cout << "Intro to OOP" << std::endl;

	fraction_t frac1;
	fraction_t* frac2 = new fraction_t;
	std::cout
		<< frac1.to_string() << std::endl
		<< frac2->to_string() << std::endl;

	fraction_t frac3(10);
	fraction_t* frac4 = new fraction_t(1,10);
	std::cout
		<< frac3.to_string() << std::endl
		<< frac4->to_string()<< std::endl;

	fraction_t frac5 = fraction_t(1, 10, (char*)"Half");
	fraction_t* frac6 = new fraction_t(frac5);
	std::cout
		<< frac5.to_string() << std::endl
		<< frac6->to_string() << std::endl;


	delete frac2;
	delete frac4;
	delete frac6;
}



























/*
ООП Вступ 
парадигма - термін що поєднує традиції пвдходи прийоми методики тощо
У програмуванні існують декілька парадигм
-Імперативна парадигма (в яку входить процедурний підхід)
програма вважвється послідовністью інструкцій серед яких лише одна
виконується у даний момент часу Окремій інструкції пргграми  дозволяють 
змінювати порядок виконання (умови цикли)

-Функціональна парадигма - базуеться на математично-функціональних засадах
програма вважається "конвертом" у якому лежить інструкція що слід 
зробити та новий конверт над яким слід виконати цю дію
ПРЕДСТАВНИКИ: LISP Python J TCL Haskel

-Декларативна парадигма ( в яку входить логічна) - базується на теорії знань
програми складається за набоору правил (аксіом) та твердження яке 
слід перевірити (теореми)
Представник: ProLog(5 покоління)

-Об'єктно-орієнтована парадигма (ООП) - базується на принципах взаємодії
Розроблялась як засіб описання еволюційних систем у яких задаються 
об'єкти та правила їх взаємодії Суть програми - еволюція системи об'єктів 
З точки практичного програмівання вносить ідею колекцій як розвиток понняття масиву але з моживостью змі розміру (через еволюцію - 
роботу програми )
Представники OOП: C# Java прототипні підпарадигми: JavaScript Python PHP


*/




