/*
ООП Вступ 
парадигма - термін що поєднує традиції пвдходи прийоми методики тощо
У програмуванні існують декілька парадигм
-Імперативна парадигма (в яку входить процедурний підхід)
програма вважвється послідовністью інструкцій серед яких лише одна
виконується у даний момент часу Окремій інструкції пргграми  дозволяють 
змінювати порядок виконання (умови цикли)

-Функціональна парадигма - базуеться на математично-функціональних засадах
програма вважається "конвертом" у якому лежить інструкція що слід 
зробити та новий конверт над яким слід виконати цю дію
ПРЕДСТАВНИКИ: LISP Python J TCL Haskel

-Декларативна парадигма ( в яку входить логічна) - базується на теорії знань
програми складається за набоору правил (аксіом) та твердження яке 
слід перевірити (теореми)
Представник: ProLog(5 покоління)

-Об'єктно-орієнтована парадигма (ООП) - базується на принципах взаємодії
Розроблялась як засіб описання еволюційних систем у яких задаються 
об'єкти та правила їх взаємодії Суть програми - еволюція системи об'єктів 
З точки практичного програмівання вносить ідею колекцій як розвиток понняття масиву але з моживостью змі розміру (через еволюцію - 
роботу програми )
Представники OOП: C# Java прототипні підпарадигми: JavaScript Python PHP


*/




